package seminars.first;

import java.text.DateFormat;
import java.text.SimpleDateFormat;
import java.util.ArrayList;
import java.util.Calendar;
import java.util.List;
import java.util.Arrays;

import static org.assertj.core.api.Assertions.*;

// < ---------- Не забудьте добавить библиотеку libs/assertj-core-3.23.1.jar - add as Library...


// Задание №1 Нужно написать в калькуляторе метод вычисления суммы покупки (метод принимает сумму, процент
// скидки и возвращает сумму со скидкой) и проверить его используя AssertJ (отрицательное числа,
// 0, дроби, проценты >=100%, обычные скидки). Все ошибки должны быть обработаны, при вводе
// недопустимых аргументов можно выбрасывать (throw new ArithmeticException("Суть ошибки");),
// но нужно проверить, что все ошибки проверяются в тестах. (Заготовки метода уже есть в классе
// Calculator - calculatingDiscount)

public class Main {

    public static void main(String[] args) {

    System.out.println();

    }
}